{
  "news": [
    {
      "id": "5084d6d4-a485-462f-8850-3440e31ca81f",
      "title": "Мы запустились",
      "content": "🎯 Краткое описание сайта\r«ОГЭ — Подготовка по русскому языку» — это современный, интуитивно понятный и полнофункциональный веб-сайт, предназначенный для помощи школьникам в самостоятельной подготовке к основному государственному экзамену (ОГЭ). Он сочетает в себе теорию, практику и мотивацию.\r\r✨ Ключевой функционал и особенности\rСайт состоит из двух основных частей: публичной (для учеников) и административной (для управления контентом).\r\rДля учеников:\r📰 Новостная лента: Ученики видят актуальные объявления о обновлениях сайта, новых тестах и важных датах.\r\r📝 Интерактивные тесты:\r\rДоступны несколько тестов по разным темам (\"Грамматическая основа\", \"Пунктуация\", \"Выразительные средства\").\r\rКрасивый и понятный интерфейс прохождения.\r\rВопросы с вариантами ответов, мгновенная проверка и объяснение правильного ответа после выбора.\r\rПо окончании теста показывается подробная статистика: количество правильных ответов, процент и разбор каждого вопроса.\r\r📘 Теоретические материалы: Цельный раздел с теорией, оформленной с помощью Markdown. Удобно структурирован по темам.\r\r⏳ Таймер обратного отсчета: Мотивирующий элемент, который показывает точное время до даты экзамена (28 мая 2026 года).\r\r👥 Страница \"О нас\": Рассказывает о цели проекта и его создателе.\r\rСовременный UI/UX:\r\rАдаптивный и стильный дизайн с темной темой.\r\rПлавные анимации, hover-эффекты, градиенты.\r\rИнтуитивная навигация между разделами.\r\rДля администратора:\r📝 Полное управление тестами:\r\rПросмотр всех тестов в формате JSON.\r\rДобавление новых тестов и удаление существующих.\r\rРедактирование любого теста прямо в текстовом поле с последующим сохранением.\r\rУдобное добавление вопросов через всплывающие окна (prompt) с валидацией.\r\rКопирование JSON теста в буфер обмена.\r\rДублирование существующих тестов.\r\r📰 Управление новостями: Добавление, редактирование и удаление новостных записей с указанием даты.\r\r📘 Управление контентом: Возможность легко менять текст на страницах \"Теория\" и \"О нас\" прямо через админ-панель, без необходимости редактировать файлы сервера.\r\rТехническая реализация (Backend - app.py):\rAPI на Flask: Реализовано полноценное REST API для всех операций (CRUD) с тестами, новостями и контентом.\r\rХранение данных: Данные хранятся в локальных JSON-файлах (tests.json, news.json, content.json), что делает проект простым в развертывании без необходимости в сложной базе данных.\r\rCORS: Настроен для корректной работы фронтенда и бэкенда.\r\rСтатические файлы: Flask обслуживает HTML-страницы и статические ресурсы (CSS, JS).",
      "date": "2025-09-17"
    },
    {
      "id": "73e0bcca-9b8a-44c6-8ab7-661df34d24e1",
      "title": "Подготовка к ОГЭ с точки зрения психологии",
      "content": "Для ученика:\rАдекватное отношение: ОГЭ — это этап, а не конец света. Результаты можно пересдать.\r\rПлан и режим: Регулярные занятия по плану + полноценный сон лучше ночных зубрежек. Решай пробники на время.\r\rУправляй тревогой:\r\rДыхание: Глубокий вдох на 4 счета, задержка на 7, медленный выдох на 8. Помогает успокоиться быстро.\r\rФокус на задаче: Думай не о баллах, а о текущем задании. Не зацикливайся на сложном — пропусти и вернись позже.\r\rПодготовь всё заранее: С вечера собери документы, ручки, воду и шоколад. Продумай маршрут.\r\rДля родителей:\rПоддерживайте, а не давите. Фразы «Мы верим в тебя» и «Мы с тобой» работают лучше, чем «Ты должен».\r\rСледите за режимом: Сон, прогулки и спорт критически важны для снижения стресса.\r\rПомогите организовать учебный процесс и место для занятий.\r\rНе запугивайте и не сравнивайте с другими. Ваш ребенок и его здоровье важнее любого экзамена.\r\rГлавное: Спокойствие и уверенность идут не от отсутствия страха, а от понимания, что у тебя есть план и поддержка.",
      "date": "2025-10-13"
    },
    {
      "id": "39a0f871-858c-48cd-9234-38b70173cc4d",
      "title": "ОГЭ 2025: что нужно знать каждому девятикласснику",
      "content": "ОГЭ (Основной государственный экзамен) — это итоговый экзамен за курс основной школы, который сдают все ученики 9-х классов. Успешная сдача необходима для получения аттестата.\r\rОсновные факты:\r\r2 обязательных предмета: Русский язык и Математика.\r\r2 предмета на выбор: Самые популярные — Обществознание, Информатика, География, Биология, Физика и Иностранные языки.\r\rДля аттестата необходимо успешно сдать все 4 экзамена.\r\r5 советов по эффективной подготовке:\r\rНачните заранее. Идеально — в начале 9-го класса.\r\rИспользуйте официальные ресурсы ФИПИ. Только там актуальные демоверсии и спецификации.\r\rРешайте пробники на время. Это поможет привыкнуть к формату и распределить силы.\r\rАнализируйте ошибки. Уделяйте больше времени темам, которые вызывают трудности.\r\rУправляйте стрессом. Полноценный сон, отдых и позитивный настрой — ключ к успеху.\r\rОГЭ — это не преграда, а возможность перейти на следующую ступень образования. Готовьтесь системно, и у вас всё получится!",
      "date": "2025-10-14"
    }
  ]
}